[
    {
        "category": "Admissions",
        "title": "First-Time Freshmen Requirements",
        "url": "https://www.tamucc.edu/admissions/first-time-freshmen.php",
        "content": "Admissions First-Time Freshmen First-Time Freshmen First-time freshmen are students who will graduate or have graduated from high school or received a GED, AND have not enrolled or completed 24 transferable hours at another institution AFTER high school or earning a GED. Students who have met the required high school diploma types below may be considered for admission by submitting a complete application. Distinguished Achievement (HB5) Recommended (UAP) Distinguished (UAP) First-time college students seeking admission should graduate high school with one of the following diploma types that include 4 English credits, 4 Math credits, 4 Science credits, 3 Social Studies credits, and 2 credits of the same Foreign Language. Homeschooled, Out-of-State students, and Private School students are exempt from the diploma type and credits requirement. How to Apply Follow these easy steps to become an Islander! If you need assistance, please contact your admissions counselor , call 361.825.7024, or email recruitment@tamucc.edu . STEP ONE: Review Admission Requirements Students who graduate high school within the high school class quartile below will be guaranteed admission if the required diploma type is earned. Although not required for admission purposes, applicants are strongly encouraged to submit SAT or ACT scores to the university for academic advising and enrollment purposes. Students from non-ranking high schools will be assigned a class rank based on their GPA, determined using the Admissions Office's internal ranking system. Please note that our nursing, engineering, graphic design, music, and theatre programs require additional information and have additional admission requirements after university acceptance. Please refer to their respective departments for more information. 1st and 2nd Quarter Guaranteed Admission: Test scores optional, but encouraged. 3rd and 4th Quarters Holistic Review: Test scores optional. Review considers combination of success indicators including test scores, unweighted high school GPA, and class rank. Students who do not meet automatic admission requirements may be considered for Conditional Freshman Admission through a holistic review of their credentials. All students are encouraged to apply. STEP TWO: Complete the ApplyTexas Application We encourage all students to complete the ApplyTexas Application The essay on the ApplyTexas application is not required. The application fee is a non-refundable processing fee and must be paid after submitting the admission application. STEP THREE: Pay the Application Fee The U.S student application is $40. Applications turned in after the posed deadlines, available below, will be increased to $50. Pay the fee online: Pay Online Pay the fee on campus to the Business Office Fee waivers: Current high school students can contact their counselor to determine if they are eligible for a college application fee waiver. Texas A&M- Corpus Christi accepts the following application fee waivers upon receipt: - ACT Application Fee Waiver. - CollegeBoard (SAT) Application Fee Waiver. - NACAC Application Fee Waiver. - Official letters or emails from school representatives verifying a student’s financial hardship. Fee waivers can be emailed to admiss@tamucc.edu . Please include your student ID number (A#) in the email. Fee waivers can be emailed from the student or the school counselor/official. STEP FOUR: Submit Official Transcript(s) HIGH SCHOOL TRANSCRIPT(S): Please request for your high school to submit your official high school transcript. Electronic: Official transcripts can be sent electronically using Naviance, TREx, Parchment, or National Student Clearinghouse to admiss@tamucc.edu . We will not accept emailed PDF transcripts from students. Postage: Official transcripts can be mailed in a sealed (unopened) envelope from the high school to the address below: Texas A&M University-Corpus Christi Office of Recruitment and Admissions 6300 Ocean Drive, Unit 5774 Corpus Christi, Texas 78412-5774 OFFICIAL COLLEGE/UNIVERSITY TRANSCRIPT(S): If you've completed college or university coursework during (or after) high school, please request for all of your transcripts to be sent to Texas A&M-Corpus Christi. Electronic: Official transcripts can be sent electronically using Naviance, Parchment, or the National Student Clearinghouse to admiss@tamucc.edu . We will not accept emailed PDF transcripts from students. Postage: Official transcripts can be mailed in a sealed (unopened) envelope from your previous institution(s) to the address below: Texas A&M University-Corpus Christi Office of Recruitment and Admissions 6300 Ocean Drive, Unit 5774 Corpus Christi, Texas 78412-5774 *OPTIONAL* Submit ACT and/or SAT Test Scores ACT and SAT Test Scores ACT and/or SAT scores are not required for an admissions decision, however they are strongly encouraged. If sending scores, they must be sent directly from the testing agency by using the following test codes: SAT: 0366; ACT: 4045 . Test scores can also be used to determine merit scholarship eligibility and college placement Texas A&M-Corpus Christi also accepts ACT and SAT scores that are posted on the back of an official sealed transcript. We recommend sending all testing attempts as our office \"super scores\" and reviews the highest scores from each test to form a new composite score. Texas Success Initiative ACT and SAT scores may also be used to exempt students from taking the Texas Success Initiative Assessment (TSI), the state-mandated college placement exam. Admitted students are required to submit TSI scores if they are not exempt to determine college-readiness. Please visit the Admitted Students page for more information or contact the Office of Academic Testing at 361.825.2334 or atcweb@tamucc.edu . Deadlines Application Deadlines Texas A&M University-Corpus Christi has rolling admissions, however we encourage students to meet the deadlines listed below as applications may close before the start of the application term to allow for timely processing and admissions. Fall Semester - Application late fee effective: July 1 Spring Semester - Application late fee effective: November 1 Summer Semester - Application late fee effective: April 1 Freshman Scholarship Deadline Your acceptance and completed Apply Texas application serves as your scholarship application, which considers you for $1,000 to $4000 per year in merit-based freshman scholarships. Fall Priority Deadline: October 1 Deadline: February 1 Additional scholarship opportunities can be found at the scholarship website . Other Steps to Consider In addition to applying to Texas A&M University-Corpus Christi and submitting required documents for an admissions decision, we encourage you to be proactive and do the following. Please visit the Texas A&M University-Corpus Christi Bacterial Meningitis webpage here , to submit proof of vaccination and for important information about vaccination requirements. Once you’ve been admitted, register with Med+Proctor to complete and submit your Bacterial Meningitis Vaccination record. You should not attempt to register with Med+Proctor as a Texas A&M University-Corpus Christi student before you’re admitted . Apply for financial aid - complete the FAFSA . Review Islander Housing opportunities. Texas A&M-Corpus Christi has a first-year residency requirement for student who reside outside of the Coastal Bend and are under the age of 21. Submit TSI test scores or exemptions. For more information on important steps after acceptance, visit our Admitted Students webpage. Other Admissions Programs Are you applying to Texas A&M University - Corpus Christi or accepted to the university through another program? Click the links below for more information. Conditional Admission Students who do not meet our automatic admission criteria may be offered Conditional Admission. This offers students academic support and structured monitoring to ensure your success through your freshman year. College Connection Program (CCP) with Del Mar College The College Connection Program (CCP) is a collaborative partnership between Texas A&M University-Corpus Christi and Del Mar College. The CCP program provides a guaranteed admission to Texas A&M-Corpus Christi for students who successfully complete the program requirements at Del Mar College. CCP students benefit from enrollment at Del Mar College and will receive services and opportunities offered by Del Mar College. Students in the CCP program will be eligible to transfer to Texas A&M University-Corpus Christi once they have completed 24 transferable credits and maintained a 2.0 GPA. Islander Academy Dual Credit For details on the Islander Academy Program, please visit the Islander Academy page . Program for System Admission (PSA) The Program for System Admission (PSA) is an alternative admissions program for students not offered admission to Texas A&M University. This pathway program allows students to study at a Texas A&M University System Institution with the plan to transfer to Texas A&M. We invite you to consider joining the Islander Family during your academic journey if you are offered the PSA program from TAMU-College Station. V isit the TAMU PSA Website for details regarding the program. Once a completed application and required documents are submitted, please allow 2 - 3 weeks for processing. You are encouraged to work with your admissions counselor throughout this process to ensure your application is complete. You can also call the Office of Undergraduate Admissions to check your application status at 361.825.7024. Admitted students, please visit our admitted student website to learn your next steps! Apply Today! Admissions Counselors First-Year Freshmen Admission Transfer Students Graduate Students Military and Veterans International Students Admitted Students Visit TAMU-CC Campus Map Meet Our Staff Contact Office of Undergraduate Admissions Student Service Center (SSC) 361.825.2624 admiss@tamucc.edu Facebook Twitter Instagram Apply Today! Request Information Visit Campus"
    }
]